ACC.regex = {
    email: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
    letters: /^[a-zA-Z\s]*$/,
    names: /^[a-zA-ZöçşığüÖÇŞİĞÜ,]+(\s{0,1}[a-zA-ZöçşığüÖÇŞİĞÜ, ])*$/,
    phone: /^[1-9]\d{2} \d{3} \d{2} \d{2}/,
    cardNumber: /^(?=.{19,19}$)/,
    phoneCustom: /^0[.\(\/]5[0-9][0-9][.\)\/][0-9]([0-9]){2}[.\ \/]([0-9]){2}[.\ \/]([0-9]){2}$/,
    validator: function (regex, value) {
        return (new RegExp(regex).test(value));
    }
};